using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Novel.Service.Model
{
    /// <summary>
    /// 类名称：Chapter
    /// 命名空间：Novel.Service.Model
    /// 类功能：小说章节
    /// </summary>
    /// 创建者：史鹏飞
    /// 创建日期：2016/8/19 18:38
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class Chapter
    {
        /// <summary>
        /// 设置或取得 章节Id
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:38
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Id { get; set; }

        /// <summary>
        /// 设置或取得 小说
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:38
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public Novel Novel { get; set; }

        /// <summary>
        /// 设置或取得 章节名称
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:40
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Name { get; set; }

        /// <summary>
        /// 设置或取得 章节号
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:40
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SerialNumber { get; set; }

        /// <summary>
        /// 设置或取得 小说内容
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:39
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Content { get; set; }
    }
}
