using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Novel.Service.Model
{
    /// <summary>
    /// 类名称：NovelExtend
    /// 命名空间：Novel.Service.Model
    /// 类功能：小说扩展
    /// </summary>
    /// 创建者：史鹏飞
    /// 创建日期：2016/8/19 18:32
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class NovelExtend
    {
        /// <summary>
        /// 设置或取得扩展Id
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Id { get; set; }

        /// <summary>
        /// 设置或取得 小说
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public Novel Novel{ get; set; }

        /// <summary>
        /// 设置或取得 Url地址
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Url { get; set; }

        /// <summary>
        /// 设置或取得 网站名称
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:36
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SiteName { get; set; }

        /// <summary>
        /// 设置或取得 小说目录正则表达式
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:37
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CatalogRegex { get; set; }

        /// <summary>
        /// 设置或取得 小说章节正则表达式
        /// </summary>
        /// 创建者：史鹏飞
        /// 创建日期：2016/8/19 18:37
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ChapterRegex { get; set; }
    }
}
